Repository: alex2021cyberhuman-team/auth-microservice
Catalog: Conduit.Auth.PresentationLayer.WebApi/Resources/SharedResource.*.resx
Languages: ru

# UserUsername
source: Username
ru: Имя пользователя

# UserPassword
source: Password
ru: Пароль

# UserEmail
source: Email
ru: Электронная почта

# UserBio
source: Bio
ru: Биография

# UserImage
source: Image
ru: Ссылка на аватар

# UsernameShouldMatch
source: Accepted only arabian digits, spec-symbols '@._-', latin and cyrillic symbols
ru: Принимаются только латинцкие и кирилические символы и арабские цифры и символы '@._-'

# PasswordShouldMatch
source: Password require contains latin upper and lower symbols, spec-symbols '!@#$&*._-' and digits
ru: Пароль должен содержать латинцкие симовлы в верхнем и нижнем регистре, спец-символы '!@#$&*._-' и цифры

# UsernameShouldBeUnique
source: This name is already used
ru: Это имя пользователя уже занято

# EmailShouldBeUnique
source: Email
ru: Эта электронная почта уже занята

# UserImageShouldExists
source: Image should be accessible for downloading
ru: Аватар должен быть доступен для загрузки
